package constant

//-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-
//- 各个服务ID，客户端面板ID起始1000
//-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-
const SERVER_GAME		=	1;	// 游戏逻辑服务器
const SERVER_CHAT		=	2; 	// 聊天服务器
const SERVER_CROSSGAME	=	100; // 跨服服务器
const SERVER_CLIENT		=	1000; // 客户端默认 refer 值
//-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-
//- RPC ID，1～1000服务器自留ID，1000～max自定义ID
//-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-
const RPC_ID_CONNECT_SERVER	=	1;	// GATE 链接后端服务
const RPC_ID_CONNECT_GATE	=	2;	// GATE 链接其他gate服务


